# ContourLabelsRelativeBase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContourLabelsRelativeBase Property
ParameterTypeId Class See Also
---
"Relative Base"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContourLabelsRelativeBase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContourLabelsRelativeBase As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContourLabelsRelativeBase {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace